posts/2026-01-08-nextcloud-en-devuan.org
#+title: Nextcloud en devuan
#+date: <2026-01-08 08:58>
#+description: 
#+filetags: red linux servidores nextcloud tailscale vpn

* Contexto
Instalación de Nextcloud en servidor Devuan con acceso remoto mediante Tailscale VPN, sin necesidad de configurar port forwarding en el modem del ISP.

** Arquitectura
#+BEGIN_SRC
Internet → Modem ISP (sin configuración) → Router OpenWRT → Servidor Devuan
                                                              ├─ Apache + Nextcloud
                                                              ├─ MariaDB
                                                              └─ Tailscale (VPN)
#+END_SRC

** Problema resuelto
- ISP provee modem muy limitado (sin acceso a configuración avanzada)
- IP dinámica
- Necesidad de acceso remoto seguro

* 1. Instalación de Nextcloud

** 2.1 Instalar dependencias
#+BEGIN_SRC bash
sudo apt update
sudo apt install apache2 mariadb-server libapache2-mod-php php \
    php-mysql php-zip php-xml php-gd php-curl php-mbstring \
    php-intl php-bcmath php-gmp php-imagick unzip wget
#+END_SRC

** 2.2 Configurar MariaDB
#+BEGIN_SRC bash
# Configuración segura inicial
sudo mysql_secure_installation
#+END_SRC

Respuestas:
- Enter current password: =(presionar Enter)=
- Set root password? =Y= → elegir contraseña segura
- Remove anonymous users? =Y=
- Disallow root login remotely? =Y=
- Remove test database? =Y=
- Reload privilege tables? =Y=

Crear base de datos:
#+BEGIN_SRC bash
sudo mysql -u root -p
#+END_SRC

#+BEGIN_SRC sql
CREATE DATABASE nextcloud CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci;
CREATE USER 'nextcloud'@'localhost' IDENTIFIED BY 'password_segura';
GRANT ALL PRIVILEGES ON nextcloud.* TO 'nextcloud'@'localhost';
FLUSH PRIVILEGES;
EXIT;
#+END_SRC

Verificar conexión:
#+BEGIN_SRC bash
mysql -u nextcloud -p nextcloud
EXIT;
#+END_SRC

** 2.3 Descargar e instalar Nextcloud
#+BEGIN_SRC bash
cd /tmp
wget https://download.nextcloud.com/server/releases/latest.tar.bz2
sudo tar -xjf latest.tar.bz2 -C /var/www/
sudo chown -R www-data:www-data /var/www/nextcloud
#+END_SRC

** 2.4 Configurar Apache
#+BEGIN_SRC bash
sudo nano /etc/apache2/sites-available/nextcloud.conf
#+END_SRC

Contenido:
#+BEGIN_SRC apache
<VirtualHost *:80>
    ServerName tu-nombre.duckdns.org
    DocumentRoot /var/www/nextcloud

    <Directory /var/www/nextcloud/>
        Require all granted
        AllowOverride All
        Options FollowSymLinks MultiViews

        <IfModule mod_dav.c>
            Dav off
        </IfModule>
    </Directory>

    ErrorLog ${APACHE_LOG_DIR}/nextcloud_error.log
    CustomLog ${APACHE_LOG_DIR}/nextcloud_access.log combined
</VirtualHost>
#+END_SRC

Activar sitio y módulos:
#+BEGIN_SRC bash
sudo a2ensite nextcloud
sudo a2enmod rewrite headers env dir mime
sudo service apache2 restart
#+END_SRC

** 2.5 Configurar PHP
#+BEGIN_SRC bash
sudo nano /etc/php/7.*/apache2/php.ini
#+END_SRC

Modificar:
#+BEGIN_SRC ini
memory_limit = 512M
upload_max_filesize = 512M
post_max_size = 512M
max_execution_time = 300
#+END_SRC

Reiniciar:
#+BEGIN_SRC bash
sudo service apache2 restart
#+END_SRC

** 2.6 Convivencia con WebDAV existente
Si ya tienes WebDAV configurado en =000-default.conf=:

#+BEGIN_SRC bash
sudo nano /etc/apache2/sites-available/000-default.conf
#+END_SRC

Modificar VirtualHost para que solo responda a IP local:
#+BEGIN_SRC apache
<VirtualHost 192.168.1.100:80>
    ServerName 192.168.1.100
    # ... resto de configuración WebDAV ...
</VirtualHost>
#+END_SRC

** 2.7 Configurar trusted_domains
#+BEGIN_SRC bash
sudo nano /var/www/nextcloud/config/config.php
#+END_SRC

#+BEGIN_SRC php
'trusted_domains' => 
  array (
    0 => 'localhost',
    1 => '192.168.1.100',
    2 => '100.x.x.x',  // IP de Tailscale (agregar después)
  ),
#+END_SRC

* 2. Instalación de Tailscale

** 3.1 Instalación manual (para Devuan)
#+BEGIN_SRC bash
# Descargar binario estático
cd /tmp
wget https://pkgs.tailscale.com/stable/tailscale_latest_amd64.tgz
tar xzf tailscale_latest_amd64.tgz
cd tailscale_*

# Copiar binarios
sudo cp tailscaled /usr/sbin/
sudo cp tailscale /usr/bin/
#+END_SRC

