2026-01-08-nextcloud-en-devuan.html
<!doctype html>
<html lang="en">
  <head>
    <meta charset="UTF-8" />
    <link
      rel="alternate"
      type="application/rss+xml"
      href="https://martiyo.github.io/rss.xml"
      title="RSS feed for https://martiyo.github.io/"
    />
    <title>Nextcloud en devuan</title>
    <meta name="author" content="martiyo" />
    <meta name="referrer" content="no-referrer" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <link href="static/style.css" rel="stylesheet" type="text/css" />
    <link rel="icon" href="static/favicon.ico" />
  </head>
  <body>
    <div id="preamble" class="status">
      <div class="header">
        <ul>
          <li><a href="https://martiyo.github.io/">/home</a></li>
          <li><a href="https://martiyo.github.io/about">/about</a></li>
          <li><a href="https://martiyo.github.io/contact">/contact</a></li>
        </ul>
        <h1>El universo perdido de GNU/Emacs</h1>
        <blockquote>
          Este blog es una farsa son solo resumenes, traducciónes y cosas que
          encuentro por ahí.
        </blockquote>
        <form>
          <input type="text" placeholder="Buscar..." />
        </form>
        <br />
      </div>
    </div>
    <div id="content">
      <div class="post-date">08 ene 2026</div>
      <h1 class="post-title">
        <a href="https://martiyo.github.io/2026-01-08-nextcloud-en-devuan.html"
          >Nextcloud en devuan</a
        >
      </h1>
      <div id="outline-container-org2a190a7" class="outline-2">
        <h2 id="org2a190a7">Contexto</h2>
        <div class="outline-text-2" id="text-org2a190a7">
          <p>
            Instalación de Nextcloud en servidor Devuan con acceso remoto
            mediante Tailscale VPN, sin necesidad de configurar port forwarding
            en el modem del ISP.
          </p>
        </div>
        <div id="outline-container-org8ae66f0" class="outline-3">
          <h3 id="org8ae66f0">Arquitectura</h3>
          <div class="outline-text-3" id="text-org8ae66f0">
            <div class="org-src-container">
              <pre class="src src-nil">
Internet → Modem ISP (sin configuración) → Router OpenWRT → Servidor Devuan
                                                              ├─ Apache + Nextcloud
                                                              ├─ MariaDB
                                                              └─ Tailscale (VPN)
</pre
              >
            </div>
          </div>
        </div>
        <div id="outline-container-org5961c3f" class="outline-3">
          <h3 id="org5961c3f">Problema resuelto</h3>
          <div class="outline-text-3" id="text-org5961c3f">
            <ul class="org-ul">
              <li>
                ISP provee modem muy limitado (sin acceso a configuración
                avanzada)
              </li>
              <li>IP dinámica</li>
              <li>Necesidad de acceso remoto seguro</li>
            </ul>
          </div>
        </div>
      </div>
      <div id="outline-container-orgf6f4e29" class="outline-2">
        <h2 id="orgf6f4e29">1. Instalación de Nextcloud</h2>
        <div class="outline-text-2" id="text-orgf6f4e29"></div>
        <div id="outline-container-orga7c868d" class="outline-3">
          <h3 id="orga7c868d">2.1 Instalar dependencias</h3>
          <div class="outline-text-3" id="text-orga7c868d">
            <div class="org-src-container">
              <pre class="src src-bash">sudo apt update
sudo apt install apache2 mariadb-server libapache2-mod-php php <span style="color: #98be65;">\</span>
    php-mysql php-zip php-xml php-gd php-curl php-mbstring <span style="color: #98be65;">\</span>
    php-intl php-bcmath php-gmp php-imagick unzip wget
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-org69eeef1" class="outline-3">
          <h3 id="org69eeef1">2.2 Configurar MariaDB</h3>
          <div class="outline-text-3" id="text-org69eeef1">
            <div class="org-src-container">
              <pre
                class="src src-bash"
              ><span style="color: #5B6268;"># </span><span style="color: #5B6268;">Configuraci&#243;n segura inicial
</span>sudo mysql_secure_installation
</pre>
            </div>

            <p>Respuestas:</p>
            <ul class="org-ul">
              <li>Enter current password: <code>(presionar Enter)</code></li>
              <li>
                Set root password? <code>Y</code> → elegir contraseña segura
              </li>
              <li>Remove anonymous users? <code>Y</code></li>
              <li>Disallow root login remotely? <code>Y</code></li>
              <li>Remove test database? <code>Y</code></li>
              <li>Reload privilege tables? <code>Y</code></li>
            </ul>

            <p>Crear base de datos:</p>
            <div class="org-src-container">
              <pre class="src src-bash">
sudo mysql -u root -p
</pre
              >
            </div>

            <div class="org-src-container">
              <pre
                class="src src-sql"
              ><span style="color: #51afef;">CREATE</span> DATABASE nextcloud <span style="color: #ECBE7B;">CHARACTER</span> <span style="color: #51afef;">SET</span> utf8mb4 <span style="color: #51afef;">COLLATE</span> utf8mb4_general_ci;
<span style="color: #51afef;">CREATE</span> <span style="color: #c678dd;">USER</span> <span style="color: #98be65;">'nextcloud'</span>@<span style="color: #98be65;">'localhost'</span> IDENTIFIED <span style="color: #51afef;">BY</span> <span style="color: #98be65;">'password_segura'</span>;
<span style="color: #51afef;">GRANT</span> <span style="color: #51afef;">ALL</span> <span style="color: #51afef;">PRIVILEGES</span> <span style="color: #51afef;">ON</span> nextcloud.* <span style="color: #51afef;">TO</span> <span style="color: #98be65;">'nextcloud'</span>@<span style="color: #98be65;">'localhost'</span>;
FLUSH <span style="color: #51afef;">PRIVILEGES</span>;
EXIT;
</pre>
            </div>

            <p>Verificar conexión:</p>
            <div class="org-src-container">
              <pre class="src src-bash">
mysql -u nextcloud -p nextcloud
EXIT;
</pre
              >
            </div>
          </div>
        </div>
        <div id="outline-container-org8f0d1b6" class="outline-3">
          <h3 id="org8f0d1b6">2.3 Descargar e instalar Nextcloud</h3>
          <div class="outline-text-3" id="text-org8f0d1b6">
            <div class="org-src-container">
              <pre
                class="src src-bash"
              ><span style="color: #c678dd;">cd</span> /tmp
wget https://download.nextcloud.com/server/releases/latest.tar.bz2
sudo tar -xjf latest.tar.bz2 -C /var/www/
sudo chown -R www-data:www-data /var/www/nextcloud
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-orgda291e5" class="outline-3">
          <h3 id="orgda291e5">2.4 Configurar Apache</h3>
          <div class="outline-text-3" id="text-orgda291e5">
            <div class="org-src-container">
              <pre class="src src-bash">
sudo nano /etc/apache2/sites-available/nextcloud.conf
</pre
              >
            </div>

            <p>Contenido:</p>
            <div class="org-src-container">
              <pre class="src src-apache">
&lt;VirtualHost *:80&gt;
    ServerName tu-nombre.duckdns.org
    DocumentRoot /var/www/nextcloud

    &lt;Directory /var/www/nextcloud/&gt;
        Require all granted
        AllowOverride All
        Options FollowSymLinks MultiViews

        &lt;IfModule mod_dav.c&gt;
            Dav off
        &lt;/IfModule&gt;
    &lt;/Directory&gt;

    ErrorLog ${APACHE_LOG_DIR}/nextcloud_error.log
    CustomLog ${APACHE_LOG_DIR}/nextcloud_access.log combined
&lt;/VirtualHost&gt;
</pre
              >
            </div>

            <p>Activar sitio y módulos:</p>
            <div class="org-src-container">
              <pre class="src src-bash">
sudo a2ensite nextcloud
sudo a2enmod rewrite headers env dir mime
sudo service apache2 restart
</pre
              >
            </div>
          </div>
        </div>
        <div id="outline-container-org3d76d87" class="outline-3">
          <h3 id="org3d76d87">2.5 Configurar PHP</h3>
          <div class="outline-text-3" id="text-org3d76d87">
            <div class="org-src-container">
              <pre class="src src-bash">
sudo nano /etc/php/7.*/apache2/php.ini
</pre
              >
            </div>

            <p>Modificar:</p>
            <div class="org-src-container">
              <pre class="src src-ini">
memory_limit = 512M
upload_max_filesize = 512M
post_max_size = 512M
max_execution_time = 300
</pre
              >
            </div>

            <p>Reiniciar:</p>
            <div class="org-src-container">
              <pre class="src src-bash">
sudo service apache2 restart
</pre
              >
            </div>
          </div>
        </div>
        <div id="outline-container-orgff2bdcb" class="outline-3">
          <h3 id="orgff2bdcb">2.6 Convivencia con WebDAV existente</h3>
          <div class="outline-text-3" id="text-orgff2bdcb">
            <p>
              Si ya tienes WebDAV configurado en <code>000-default.conf</code>:
            </p>

            <div class="org-src-container">
              <pre class="src src-bash">
sudo nano /etc/apache2/sites-available/000-default.conf
</pre
              >
            </div>

            <p>Modificar VirtualHost para que solo responda a IP local:</p>
            <div class="org-src-container">
              <pre class="src src-apache">
&lt;VirtualHost 192.168.1.100:80&gt;
    ServerName 192.168.1.100
    # ... resto de configuración WebDAV ...
&lt;/VirtualHost&gt;
</pre
              >
            </div>
          </div>
        </div>
        <div id="outline-container-orgd42b02c" class="outline-3">
          <h3 id="orgd42b02c">2.7 Configurar trusted<sub>domains</sub></h3>
          <div class="outline-text-3" id="text-orgd42b02c">
            <div class="org-src-container">
              <pre class="src src-bash">
sudo nano /var/www/nextcloud/config/config.php
</pre
              >
            </div>

            <div class="org-src-container">
              <pre class="src src-php">
'trusted_domains' =&gt; 
  array (
    0 =&gt; 'localhost',
    1 =&gt; '192.168.1.100',
    2 =&gt; '100.x.x.x',  // IP de Tailscale (agregar después)
  ),
</pre
              >
            </div>
          </div>
        </div>
      </div>
      <div id="outline-container-orgd3944d5" class="outline-2">
        <h2 id="orgd3944d5">2. Instalación de Tailscale</h2>
        <div class="outline-text-2" id="text-orgd3944d5"></div>
        <div id="outline-container-orgbc77981" class="outline-3">
          <h3 id="orgbc77981">3.1 Instalación manual (para Devuan)</h3>
          <div class="outline-text-3" id="text-orgbc77981">
            <div class="org-src-container">
              <pre
                class="src src-bash"
              ><span style="color: #5B6268;"># </span><span style="color: #5B6268;">Descargar binario est&#225;tico
</span><span style="color: #c678dd;">cd</span> /tmp
wget https://pkgs.tailscale.com/stable/tailscale_latest_amd64.tgz
tar xzf tailscale_latest_amd64.tgz
<span style="color: #c678dd;">cd</span> tailscale_*

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Copiar binarios
</span>sudo cp tailscaled /usr/sbin/
sudo cp tailscale /usr/bin/
</pre>
            </div>
          </div>
        </div>
