posts/2026-01-08-nextcloud-en-devuan.org
** 3.2 Crear servicio SysVinit
#+BEGIN_SRC bash
sudo nano /etc/init.d/tailscaled
#+END_SRC

Contenido completo del script:
#+BEGIN_SRC bash
#!/bin/sh
### BEGIN INIT INFO
# Provides:          tailscaled
# Required-Start:    $network $local_fs
# Required-Stop:     $network $local_fs
# Default-Start:     2 3 4 5
# Default-Stop:      0 1 6
# Short-Description: Tailscale VPN
### END INIT INFO

DAEMON=/usr/sbin/tailscaled
PIDFILE=/var/run/tailscaled.pid
STATE_DIR=/var/lib/tailscale

case "$1" in
  start)
    mkdir -p $STATE_DIR
    start-stop-daemon --start --background --make-pidfile --pidfile $PIDFILE \
      --exec $DAEMON -- --state=$STATE_DIR/tailscaled.state
    ;;
  stop)
    start-stop-daemon --stop --pidfile $PIDFILE
    rm -f $PIDFILE
    ;;
  restart)
    $0 stop
    sleep 2
    $0 start
    ;;
  status)
    if [ -f $PIDFILE ]; then
      echo "Tailscale is running (PID $(cat $PIDFILE))"
    else
      echo "Tailscale is not running"
    fi
    ;;
  *)
    echo "Usage: /etc/init.d/tailscaled {start|stop|restart|status}"
    exit 1
    ;;
esac

exit 0
#+END_SRC

** 3.3 Habilitar e iniciar servicio
#+BEGIN_SRC bash
sudo chmod +x /etc/init.d/tailscaled
sudo mkdir -p /var/lib/tailscale
sudo update-rc.d tailscaled defaults
sudo /etc/init.d/tailscaled start
#+END_SRC

** 3.4 Conectar a Tailscale
#+BEGIN_SRC bash
sudo tailscale up
#+END_SRC

Copiar la URL que muestra, abrir en navegador y autenticar con cuenta de Tailscale (Google/Microsoft/GitHub).

** 3.5 Verificar IP asignada
#+BEGIN_SRC bash
tailscale ip -4
#+END_SRC

Resultado: =100.x.x.x=

** 3.6 Agregar IP de Tailscale a trusted_domains
#+BEGIN_SRC bash
sudo nano /var/www/nextcloud/config/config.php
#+END_SRC

Agregar la IP =100.x.x.x= al array de =trusted_domains=.

* 3. Acceso a Nextcloud

** Desde red local
#+BEGIN_SRC
http://192.168.1.100
#+END_SRC

** Desde cualquier lugar (con Tailscale instalado)
#+BEGIN_SRC
http://100.x.x.x
#+END_SRC

** Instalación de clientes Tailscale
- *PC:* https://tailscale.com/download
- *Móvil:* App "Tailscale" en Play Store / App Store
- Login con la misma cuenta

** (Opcional) Activar MagicDNS
URL: https://login.tailscale.com/admin/dns

Activar MagicDNS para usar nombre en vez de IP:
#+BEGIN_SRC
http://devuan.tail-xxxxx.ts.net
#+END_SRC

* 4. Verificación y mantenimiento

** Verificar servicios
#+BEGIN_SRC bash
# Apache
sudo service apache2 status 

# MariaDB
sudo service mariadb status

# Tailscale
tailscale status
sudo /etc/init.d/tailscaled status
#+END_SRC

** Logs importantes
#+BEGIN_SRC bash
# Apache/Nextcloud
sudo tail -f /var/log/apache2/nextcloud_error.log
sudo tail -f /var/log/apache2/nextcloud_access.log

#+END_SRC

** Permisos de Nextcloud
#+BEGIN_SRC bash
sudo chown -R www-data:www-data /var/www/nextcloud
#+END_SRC

** Actualizar Nextcloud
Desde la interfaz web: =Settings → Overview=

* 5. Ventajas de la solución

- ✅ *Sin configuración del modem ISP:* No requiere port forwarding
- ✅ *Acceso seguro:* VPN cifrada punto a punto
- ✅ *IP dinámica:* DuckDNS mantiene el dominio actualizado
- ✅ *Múltiples dispositivos:* Acceso desde PC, móvil, tablet
- ✅ *Funciona en cualquier red:* WiFi pública, 4G, etc.
- ✅ *Gratuito:* Tanto Tailscale como DuckDNS son gratis para uso personal

* 6. Aplicaciones de Nextcloud recomendadas

Desde la interfaz web de Nextcloud, instalar:
- *Calendar:* Calendario sincronizado
- *Contacts:* Libreta de contactos
- *Notes:* Notas markdown
- *Talk:* Videoconferencias
- *Deck:* Tablero Kanban
- *News:* Lector RSS
- *Bookmarks:* Marcadores sincronizados

* 7. Clientes de sincronización

** Desktop
- URL: https://nextcloud.com/install/#install-clients
- Sincroniza carpetas automáticamente

