2026-01-08-nextcloud-en-devuan.html
        <div id="outline-container-org6826982" class="outline-3">
          <h3 id="org6826982">3.2 Crear servicio SysVinit</h3>
          <div class="outline-text-3" id="text-org6826982">
            <div class="org-src-container">
              <pre class="src src-bash">
sudo nano /etc/init.d/tailscaled
</pre
              >
            </div>

            <p>Contenido completo del script:</p>
            <div class="org-src-container">
              <pre
                class="src src-bash"
              ><span style="color: #5B6268;">#</span><span style="color: #5B6268;">!/bin/</span><span style="color: #51afef;">sh</span><span style="color: #5B6268;">
</span><span style="color: #5B6268;">### </span><span style="color: #5B6268;">BEGIN INIT INFO
</span><span style="color: #5B6268;"># </span><span style="color: #5B6268;">Provides:          tailscaled
</span><span style="color: #5B6268;"># </span><span style="color: #5B6268;">Required-Start:    $network $local_fs
</span><span style="color: #5B6268;"># </span><span style="color: #5B6268;">Required-Stop:     $network $local_fs
</span><span style="color: #5B6268;"># </span><span style="color: #5B6268;">Default-Start:     2 3 4 5
</span><span style="color: #5B6268;"># </span><span style="color: #5B6268;">Default-Stop:      0 1 6
</span><span style="color: #5B6268;"># </span><span style="color: #5B6268;">Short-Description: Tailscale VPN
</span><span style="color: #5B6268;">### </span><span style="color: #5B6268;">END INIT INFO
</span>
<span style="color: #dcaeea;">DAEMON</span>=/usr/sbin/tailscaled
<span style="color: #dcaeea;">PIDFILE</span>=/var/run/tailscaled.pid
<span style="color: #dcaeea;">STATE_DIR</span>=/var/lib/tailscale

<span style="color: #51afef;">case</span> <span style="color: #98be65;">"$1"</span><span style="color: #51afef;"> in</span>
  start)
    mkdir -p $<span style="color: #dcaeea;">STATE_DIR</span>
    start-stop-daemon --start --background --make-pidfile --pidfile $<span style="color: #dcaeea;">PIDFILE</span> <span style="color: #98be65;">\</span>
      --exec $<span style="color: #dcaeea;">DAEMON</span> -- --state=$<span style="color: #dcaeea;">STATE_DIR</span>/tailscaled.state
    ;;
  stop)
    start-stop-daemon --stop --pidfile $<span style="color: #dcaeea;">PIDFILE</span>
    rm -f $<span style="color: #dcaeea;">PIDFILE</span>
    ;;
  restart)
    $<span style="color: #dcaeea;">0</span> stop
    sleep 2
    $<span style="color: #dcaeea;">0</span> start
    ;;
  status)
    <span style="color: #51afef;">if</span> [ -f $<span style="color: #dcaeea;">PIDFILE</span> ]; <span style="color: #51afef;">then</span>
      <span style="color: #c678dd;">echo</span> <span style="color: #98be65;">"Tailscale is running (PID $(</span><span style="color: #51afef; font-weight: bold;">cat $PIDFILE</span><span style="color: #98be65;">))"</span>
    <span style="color: #51afef;">else</span>
      <span style="color: #c678dd;">echo</span> <span style="color: #98be65;">"Tailscale is not running"</span>
    <span style="color: #51afef;">fi</span>
    ;;
  *)
    <span style="color: #c678dd;">echo</span> <span style="color: #98be65;">"Usage: /etc/init.d/tailscaled {start|stop|restart|status}"</span>
    <span style="color: #51afef;">exit</span> 1
    ;;
<span style="color: #51afef;">esac</span>

<span style="color: #51afef;">exit</span> 0
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-org4a0cbc9" class="outline-3">
          <h3 id="org4a0cbc9">3.3 Habilitar e iniciar servicio</h3>
          <div class="outline-text-3" id="text-org4a0cbc9">
            <div class="org-src-container">
              <pre class="src src-bash">
sudo chmod +x /etc/init.d/tailscaled
sudo mkdir -p /var/lib/tailscale
sudo update-rc.d tailscaled defaults
sudo /etc/init.d/tailscaled start
</pre
              >
            </div>
          </div>
        </div>
        <div id="outline-container-org915a5fa" class="outline-3">
          <h3 id="org915a5fa">3.4 Conectar a Tailscale</h3>
          <div class="outline-text-3" id="text-org915a5fa">
            <div class="org-src-container">
              <pre class="src src-bash">
sudo tailscale up
</pre
              >
            </div>

            <p>
              Copiar la URL que muestra, abrir en navegador y autenticar con
              cuenta de Tailscale (Google/Microsoft/GitHub).
            </p>
          </div>
        </div>
        <div id="outline-container-org0103f2e" class="outline-3">
          <h3 id="org0103f2e">3.5 Verificar IP asignada</h3>
          <div class="outline-text-3" id="text-org0103f2e">
            <div class="org-src-container">
              <pre class="src src-bash">
tailscale ip -4
</pre
              >
            </div>

            <p>Resultado: <code>100.x.x.x</code></p>
          </div>
        </div>
        <div id="outline-container-org7e206de" class="outline-3">
          <h3 id="org7e206de">
            3.6 Agregar IP de Tailscale a trusted<sub>domains</sub>
          </h3>
          <div class="outline-text-3" id="text-org7e206de">
            <div class="org-src-container">
              <pre class="src src-bash">
sudo nano /var/www/nextcloud/config/config.php
</pre
              >
            </div>

            <p>
              Agregar la IP <code>100.x.x.x</code> al array de
              <code>trusted_domains</code>.
            </p>
          </div>
        </div>
      </div>
      <div id="outline-container-orge26947d" class="outline-2">
        <h2 id="orge26947d">3. Acceso a Nextcloud</h2>
        <div class="outline-text-2" id="text-orge26947d"></div>
        <div id="outline-container-orgbfc3017" class="outline-3">
          <h3 id="orgbfc3017">Desde red local</h3>
          <div class="outline-text-3" id="text-orgbfc3017">
            <div class="org-src-container">
              <pre class="src src-nil">
http://192.168.1.100
</pre
              >
            </div>
          </div>
        </div>
        <div id="outline-container-org18b402c" class="outline-3">
          <h3 id="org18b402c">
            Desde cualquier lugar (con Tailscale instalado)
          </h3>
          <div class="outline-text-3" id="text-org18b402c">
            <div class="org-src-container">
              <pre class="src src-nil">
http://100.x.x.x
</pre
              >
            </div>
          </div>
        </div>
        <div id="outline-container-org1c61895" class="outline-3">
          <h3 id="org1c61895">Instalación de clientes Tailscale</h3>
          <div class="outline-text-3" id="text-org1c61895">
            <ul class="org-ul">
              <li>
                <b>PC:</b>
                <a href="https://tailscale.com/download"
                  >https://tailscale.com/download</a
                >
              </li>
              <li><b>Móvil:</b> App "Tailscale" en Play Store / App Store</li>
              <li>Login con la misma cuenta</li>
            </ul>
          </div>
        </div>
        <div id="outline-container-orgaad01fc" class="outline-3">
          <h3 id="orgaad01fc">(Opcional) Activar MagicDNS</h3>
          <div class="outline-text-3" id="text-orgaad01fc">
            <p>
              URL:
              <a href="https://login.tailscale.com/admin/dns"
                >https://login.tailscale.com/admin/dns</a
              >
            </p>

            <p>Activar MagicDNS para usar nombre en vez de IP:</p>
            <div class="org-src-container">
              <pre class="src src-nil">
http://devuan.tail-xxxxx.ts.net
</pre
              >
            </div>
          </div>
        </div>
      </div>
      <div id="outline-container-org2518f35" class="outline-2">
        <h2 id="org2518f35">4. Verificación y mantenimiento</h2>
        <div class="outline-text-2" id="text-org2518f35"></div>
        <div id="outline-container-org60aefc5" class="outline-3">
          <h3 id="org60aefc5">Verificar servicios</h3>
          <div class="outline-text-3" id="text-org60aefc5">
            <div class="org-src-container">
              <pre
                class="src src-bash"
              ><span style="color: #5B6268;"># </span><span style="color: #5B6268;">Apache
</span>sudo service apache2 status 

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">MariaDB
</span>sudo service mariadb status

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Tailscale
</span>tailscale status
sudo /etc/init.d/tailscaled status
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-org53b9740" class="outline-3">
          <h3 id="org53b9740">Logs importantes</h3>
          <div class="outline-text-3" id="text-org53b9740">
            <div class="org-src-container">
              <pre
                class="src src-bash"
              ><span style="color: #5B6268;"># </span><span style="color: #5B6268;">Apache/Nextcloud
</span>sudo tail -f /var/log/apache2/nextcloud_error.log
sudo tail -f /var/log/apache2/nextcloud_access.log

</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-org81f9bdf" class="outline-3">
          <h3 id="org81f9bdf">Permisos de Nextcloud</h3>
          <div class="outline-text-3" id="text-org81f9bdf">
            <div class="org-src-container">
              <pre class="src src-bash">
sudo chown -R www-data:www-data /var/www/nextcloud
</pre
              >
            </div>
          </div>
        </div>
        <div id="outline-container-orga9c5bb9" class="outline-3">
          <h3 id="orga9c5bb9">Actualizar Nextcloud</h3>
          <div class="outline-text-3" id="text-orga9c5bb9">
            <p>Desde la interfaz web: <code>Settings → Overview</code></p>
          </div>
        </div>
      </div>
      <div id="outline-container-org3e2ae68" class="outline-2">
        <h2 id="org3e2ae68">5. Ventajas de la solución</h2>
        <div class="outline-text-2" id="text-org3e2ae68">
          <ul class="org-ul">
            <li>
              ✅ <b>Sin configuración del modem ISP:</b> No requiere port
              forwarding
            </li>
            <li>✅ <b>Acceso seguro:</b> VPN cifrada punto a punto</li>
            <li>
              ✅ <b>IP dinámica:</b> DuckDNS mantiene el dominio actualizado
            </li>
            <li>
              ✅ <b>Múltiples dispositivos:</b> Acceso desde PC, móvil, tablet
            </li>
            <li>✅ <b>Funciona en cualquier red:</b> WiFi pública, 4G, etc.</li>
            <li>
              ✅ <b>Gratuito:</b> Tanto Tailscale como DuckDNS son gratis para
              uso personal
            </li>
          </ul>
        </div>
      </div>
      <div id="outline-container-org90376ea" class="outline-2">
        <h2 id="org90376ea">6. Aplicaciones de Nextcloud recomendadas</h2>
        <div class="outline-text-2" id="text-org90376ea">
          <p>Desde la interfaz web de Nextcloud, instalar:</p>
          <ul class="org-ul">
            <li><b>Calendar:</b> Calendario sincronizado</li>
            <li><b>Contacts:</b> Libreta de contactos</li>
            <li><b>Notes:</b> Notas markdown</li>
            <li><b>Talk:</b> Videoconferencias</li>
            <li><b>Deck:</b> Tablero Kanban</li>
            <li><b>News:</b> Lector RSS</li>
            <li><b>Bookmarks:</b> Marcadores sincronizados</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-org1279903" class="outline-2">
        <h2 id="org1279903">7. Clientes de sincronización</h2>
        <div class="outline-text-2" id="text-org1279903"></div>
        <div id="outline-container-org9006c5a" class="outline-3">
          <h3 id="org9006c5a">Desktop</h3>
          <div class="outline-text-3" id="text-org9006c5a">
            <ul class="org-ul">
              <li>
                URL:
                <a href="https://nextcloud.com/install/#install-clients"
                  >https://nextcloud.com/install/#install-clients</a
                >
              </li>
              <li>Sincroniza carpetas automáticamente</li>
            </ul>
          </div>
        </div>
