posts/2026-01-08-nextcloud-en-devuan.org
** Móvil
- *Android:* "Nextcloud" en Play Store
- *iOS:* "Nextcloud" en App Store
- Sincronización automática de fotos

* 8. Troubleshooting común

** Error: "Access through untrusted domain"
Agregar dominio/IP a =trusted_domains= en =/var/www/nextcloud/config/config.php=

** Error de conexión a base de datos
#+BEGIN_SRC bash
sudo service mariadb status
sudo service mariadb start
#+END_SRC

** Tailscale no inicia al arranque
#+BEGIN_SRC bash
sudo update-rc.d tailscaled defaults
sudo /etc/init.d/tailscaled start
#+END_SRC

** Permisos incorrectos
#+BEGIN_SRC bash
sudo chown -R www-data:www-data /var/www/nextcloud
sudo chmod -R 755 /var/www/nextcloud
#+END_SRC

* 9. Recursos adicionales

- *Nextcloud Docs:* https://docs.nextcloud.com
- *Tailscale Docs:* https://tailscale.com/kb
- *DuckDNS:* https://www.duckdns.org
- *Devuan:* https://www.devuan.org

* Notas finales

Esta configuración proporciona:
1. Almacenamiento en la nube auto-hospedado
2. Acceso remoto seguro sin exponer puertos
3. Independencia de las limitaciones del ISP
4. Control total sobre tus datos

El sistema es escalable y puede extenderse con más servicios según necesidad.
