2026-01-08-nextcloud-en-devuan.html
        <div id="outline-container-org852c067" class="outline-3">
          <h3 id="org852c067">Móvil</h3>
          <div class="outline-text-3" id="text-org852c067">
            <ul class="org-ul">
              <li><b>Android:</b> "Nextcloud" en Play Store</li>
              <li><b>iOS:</b> "Nextcloud" en App Store</li>
              <li>Sincronización automática de fotos</li>
            </ul>
          </div>
        </div>
      </div>
      <div id="outline-container-orgd778a42" class="outline-2">
        <h2 id="orgd778a42">8. Troubleshooting común</h2>
        <div class="outline-text-2" id="text-orgd778a42"></div>
        <div id="outline-container-orgf01687d" class="outline-3">
          <h3 id="orgf01687d">Error: "Access through untrusted domain"</h3>
          <div class="outline-text-3" id="text-orgf01687d">
            <p>
              Agregar dominio/IP a <code>trusted_domains</code> en
              <code>/var/www/nextcloud/config/config.php</code>
            </p>
          </div>
        </div>
        <div id="outline-container-org0b5fbb2" class="outline-3">
          <h3 id="org0b5fbb2">Error de conexión a base de datos</h3>
          <div class="outline-text-3" id="text-org0b5fbb2">
            <div class="org-src-container">
              <pre class="src src-bash">
sudo service mariadb status
sudo service mariadb start
</pre
              >
            </div>
          </div>
        </div>
        <div id="outline-container-orgaea0674" class="outline-3">
          <h3 id="orgaea0674">Tailscale no inicia al arranque</h3>
          <div class="outline-text-3" id="text-orgaea0674">
            <div class="org-src-container">
              <pre class="src src-bash">
sudo update-rc.d tailscaled defaults
sudo /etc/init.d/tailscaled start
</pre
              >
            </div>
          </div>
        </div>
        <div id="outline-container-orgd89d904" class="outline-3">
          <h3 id="orgd89d904">Permisos incorrectos</h3>
          <div class="outline-text-3" id="text-orgd89d904">
            <div class="org-src-container">
              <pre class="src src-bash">
sudo chown -R www-data:www-data /var/www/nextcloud
sudo chmod -R 755 /var/www/nextcloud
</pre
              >
            </div>
          </div>
        </div>
      </div>
      <div id="outline-container-orgff3fb1d" class="outline-2">
        <h2 id="orgff3fb1d">9. Recursos adicionales</h2>
        <div class="outline-text-2" id="text-orgff3fb1d">
          <ul class="org-ul">
            <li>
              <b>Nextcloud Docs:</b>
              <a href="https://docs.nextcloud.com"
                >https://docs.nextcloud.com</a
              >
            </li>
            <li>
              <b>Tailscale Docs:</b>
              <a href="https://tailscale.com/kb">https://tailscale.com/kb</a>
            </li>
            <li>
              <b>DuckDNS:</b>
              <a href="https://www.duckdns.org">https://www.duckdns.org</a>
            </li>
            <li>
              <b>Devuan:</b>
              <a href="https://www.devuan.org">https://www.devuan.org</a>
            </li>
          </ul>
        </div>
      </div>
      <div id="outline-container-org61c20d7" class="outline-2">
        <h2 id="org61c20d7">Notas finales</h2>
        <div class="outline-text-2" id="text-org61c20d7">
          <p>Esta configuración proporciona:</p>
          <ol class="org-ol">
            <li>Almacenamiento en la nube auto-hospedado</li>
            <li>Acceso remoto seguro sin exponer puertos</li>
            <li>Independencia de las limitaciones del ISP</li>
            <li>Control total sobre tus datos</li>
          </ol>

          <p>
            El sistema es escalable y puede extenderse con más servicios según
            necesidad.
          </p>
        </div>
      </div>
      <div class="taglist">
        <a href="https://martiyo.github.io/tags.html">Tags</a>:
        <a href="https://martiyo.github.io/tag-red.html">red</a>
        <a href="https://martiyo.github.io/tag-linux.html">linux</a>
        <a href="https://martiyo.github.io/tag-servidores.html">servidores</a>
        <a href="https://martiyo.github.io/tag-nextcloud.html">nextcloud</a>
        <a href="https://martiyo.github.io/tag-tailscale.html">tailscale</a>
        <a href="https://martiyo.github.io/tag-vpn.html">vpn</a>
      </div>
    </div>
    <div id="postamble" class="status">
      <div id="archive">
        <a href="https://martiyo.github.io/archive.html">Other posts</a>
      </div>
      <footer></footer>
    </div>
  </body>
</html>
